table_name = ["progers", "eltech", "maths", "physics"]
name_of_subject = ["Системка", "Электротехника", "Дискретная математика", "Физика"]
subject_to_table = {
    name_of_subject[0]: table_name[0],
    name_of_subject[1]: table_name[1],
    name_of_subject[2]: table_name[2],
    name_of_subject[3]: table_name[3],
}
table_to_subject = {
    table_name[0]: name_of_subject[0],
    table_name[1]: name_of_subject[1],
    table_name[2]: name_of_subject[2],
    table_name[3]: name_of_subject[3],
}
questions = [
    {'subject': name_of_subject[0], 'attachment': 'doc-201455689_580090252'},
    {'subject': name_of_subject[1], 'attachment': 'doc-201455689_580090282'},
    {'subject': name_of_subject[2], 'attachment': 'doc-201455689_580090267'},
    {'subject': name_of_subject[3], 'attachment': 'doc-201455689_580185604'},
]

id_community = 201455689

faq = f"Привет!\nЭтот бот создан для оптимизации работы над приготовлением ответов к сессии." \
        f"\nБери задания, делай качественно, отправляй и будет тебе счастье!"



countries = [
    '&#127479;&#127482; Пошел нахуй,',
    '&#127464;&#127475; &#127469;&#127472; 操你,',
    '&#127465;&#127466; &#127462;&#127481; &#127463;&#127466; &#127464;&#127469; Fick dich,',
    '&#127466;&#127480; &#127464;&#127473; &#127464;&#127476; &#127474;&#127485; &#127477;&#127479; Vete a la mierda,',
    '&#127467;&#127479; Va te faire foutre,',
    '&#127468;&#127463; &#127482;&#127480; &#127462;&#127482; &#127464;&#127462; &#127475;&#127487; Fuck you,',
    '&#127470;&#127481; Vaffanculo,',
    '&#127471;&#127477; あなたをファック,',
    '&#127472;&#127479; 엿 먹어,',
    '&#127482;&#127462; Пішов нахуй,',
    '&#127462;&#127466; &#127480;&#127462; اللعنة عليك,',
    '&#127477;&#127481; &#127463;&#127479; &#127474;&#127476; Foda-se,',
    '&#127465;&#127472; Fuck dig,',
    '&#127467;&#127470; Vittu,',
    '&#127470;&#127465; Persetan denganmu,',
    '&#127470;&#127466; Fuck tú,',
    '&#127470;&#127475; फक यू,',
    '&#127474;&#127486; &#127480;&#127468; Kacau awak,',
    '&#127475;&#127473; Fuck you,',
    '&#127475;&#127476; Knulle deg,',
    '&#127477;&#127469; Fuck you,',
    '&#127477;&#127473; Pierdol się,',
    '&#127480;&#127466; Knulla dig,',
    '&#127483;&#127475; Mẹ kiếp,',
    '&#127487;&#127462; Fuck wewe,',
    '&#127472;&#127487; Бля,',
    '&#127463;&#127486; Пайшоў нахуй,',
    '&#127470;&#127473; תזיין אותך,',
    '&#127481;&#127479; Siktir git,',
    ]