tasks = [
    {
        'table_name': 'eltech',
        'tasks': [
            {
                'num': 1,
                'type': 1,
                'text': 'Укажите основные преимущества и недостатки электрической энергии.',
            },
            {
                'num': 2,
                'type': 1,
                'text': 'Опишите основные компоненты электрической цепи. Дайте определения линейного и нелинейного элемента применительно к цепям постоянного тока, линейной и нелинейной электрической цепи.',
            },
            {
                'num': 3,
                'type': 1,
                'text': 'Дайте определения таким понятиям как: «идеальный источник ЭДС», «идеальный источник тока»; изобразите их вольт-амперные характеристики.',
            },
            {
                'num': 4,
                'type': 1,
                'text': 'Сформулируйте закон Ома для участка цепи без ЭДС, с ЭДС. Сформулируйте законы Кирхгофа для цепи постоянного тока.',
            },
            {
                'num': 5,
                'type': 1,
                'text': 'Перечислите характерные режимы работы электрической цепи, дайте их краткую характеристику и укажите соответствующий им участок на вольтамперной характеристике.',
            },
            {
                'num': 6,
                'type': 1,
                'text': 'Опишите конструкцию и принцип действия синхронного генератора синусоидальной ЭДС.',
            },
            {
                'num': 7,
                'type': 1,
                'text': 'Охарактеризуйте работу цепи синусоидального тока с активным, индуктивным и емкостным элементами.',
            },
            {
                'num': 8,
                'type': 1,
                'text': 'Перечислите виды мощностей цепи синусоидального тока и поясните, что они характеризуют и какими соотношениями связаны между собой. ',
            },
            {
                'num': 9,
                'type': 1,
                'text': 'Раскройте значение терминов: «треугольник сопротивлений», «треугольник проводимостей», «треугольник мощностей».',
            },
            {
                'num': 10,
                'type': 1,
                'text': 'Дайте определение резонанса токов и напряжений в цепях синусоидального тока, поясните условия его возникновения. Охарактеризуйте явление резонанса в цепи синусоидального тока с энергетической точки зрения.',
            },
            {
                'num': 11,
                'type': 1,
                'text': 'Раскройте значение термина «топографическая диаграмма напряжений».',
            },
            {
                'num': 12,
                'type': 1,
                'text': 'Опишите процесс генерирования трехфазной ЭДС и конструкцию трехфазного генератора.',
            },
            {
                'num': 13,
                'type': 1,
                'text': 'Опишите основные схемы соединения фаз источника и приемника трехфазных цепей. Укажите для них основные соотношения между линейными и фазными токами и напряжениями источника и приемника.',
            },
            {
                'num': 14,
                'type': 1,
                'text': 'Изложите порядок расчета линейной электрической цепи при несинусоидальном напряжении источника питания. Поясните влияние параметров цепи на изменение тока во времени.',
            },
            {
                'num': 15,
                'type': 1,
                'text': 'Опишите конструкцию и принцип действия электрических реактивных фильтров НЧ, ВЧ, ЗФ, ПФ.',
            },
            {
                'num': 16,
                'type': 1,
                'text': 'Сформулируйте законы коммутации и укажите их место в алгоритме расчета переходных процессов классическим методом.',
            },
            {
                'num': 17,
                'type': 1,
                'text': 'Дайте определение основным величинам, характеризующим магнитное поле.',
            },
            {
                'num': 18,
                'type': 1,
                'text': 'Сформулируйте закон Ома и законы Кирхгофа для магнитных цепей.',
            },
            {
                'num': 19,
                'type': 1,
                'text': 'Опишите конструкцию и принцип действия трансформатора.',
            },
            {
                'num': 20,
                'type': 1,
                'text': 'Опишите характерные режимы работы трансформатора. Охарактеризуйте основные виды потерь мощности в трансформаторе и способы их экспериментального определения.',
            },
            {
                'num': 1,
                'type': 2,
                'text': 'Приведите пример расчета цепи постоянного тока методом непосредственного применения законов Кирхгофа.',
            },
            {
                'num': 2,
                'type': 2,
                'text': 'Приведите пример расчета цепи постоянного тока методом контурных токов.',
            },
            {
                'num': 3,
                'type': 2,
                'text': 'Приведите пример расчета цепи постоянного тока методом узловых потенциалов.',
            },
            {
                'num': 4,
                'type': 2,
                'text': 'Приведите пример расчета цепи постоянного тока методом двух узлов.',
            },
            {
                'num': 5,
                'type': 2,
                'text': 'Приведите пример расчета цепи постоянного тока методом преобразований. Изложите концепцию основных типов преобразований.',
            },
            {
                'num': 6,
                'type': 2,
                'text': 'Раскройте область применения и приведите пример расчета цепи постоянного тока мето-дом пропорциональных величин.',
            },
            {
                'num': 7,
                'type': 2,
                'text': 'Приведите пример расчета цепи постоянного тока методом наложения.',
            },
            {
                'num': 8,
                'type': 2,
                'text': 'Приведите пример расчета цепи постоянного тока методом эквивалентного генератора (ЭДС).',
            },
            {
                'num': 9,
                'type': 2,
                'text': 'Сформулируйте условие передачи максимальной мощности от источника к электроприемнику в цепи постоянного тока.',
            },
            {
                'num': 10,
                'type': 2,
                'text': 'Объясните, как вычислить статическое и дифференциальное сопротивления нелинейного элемента по его вольт-амперной характеристике.',
            },
            {
                'num': 11,
                'type': 2,
                'text': 'Изложите концепцию и приведите пример графического метода анализа электрических цепей постоянного тока с нелинейными элементами.',
            },
            {
                'num': 12,
                'type': 2,
                'text': 'Изложите концепцию и приведите пример символического метода анализа электрических цепей синусоидального тока.',
            },
            {
                'num': 13,
                'type': 2,
                'text': 'Сформулируйте условие передачи максимальной мощности от источника к электропри-емнику в цепи синусоидального тока.',
            },
            {
                'num': 14,
                'type': 2,
                'text': 'Предложите способ увеличения коэффициента мощности.',
            },
            {
                'num': 15,
                'type': 2,
                'text': 'Приведите пример представления периодической несинусоидальной функции рядом Фу-рье.',
            },
            {
                'num': 16,
                'type': 2,
                'text': 'Определите, как изменится активная мощность трехфазной цепи с симметричной нагруз-кой при переключении схемы соединения фаз приемника со звезды на треугольник.',
            },
            {
                'num': 17,
                'type': 2,
                'text': 'Приведите алгоритм решения прямой и обратной задач анализа неразветвленных магнит-ных цепей.',
            },
            {
                'num': 18,
                'type': 2,
                'text': 'Изложите концепцию расчета разветвленных магнитных цепей.',
            },
            {
                'num': 19,
                'type': 2,
                'text': 'Приведите пример расчета переходных процессов классическим методом.',
            },
            {
                'num': 20,
                'type': 2,
                'text': 'Приведите пример анализа фильтра в частотной области.',
            },
            {
                'num': 1,
                'type': 3,
                'text': 'photo-201455689_457239017',
            },
            {
                'num': 2,
                'type': 3,
                'text': 'photo-201455689_457239018',
            },
            {
                'num': 3,
                'type': 3,
                'text': 'photo-201455689_457239019',
            },
        ]
    },
    {
        'table_name': 'maths',
        'tasks': [
            {
                'num': 1,
                'type': 1,
                'text': 'Множество. Операции над множествами.',
            },
            {
                'num': 2,
                'type': 1,
                'text': 'Табличный метод доказательства тождеств теории множеств.',
            },
            {
                'num': 3,
                'type': 1,
                'text': 'Применение диаграмм Эйлера-Венна для доказательства тождеств.',
            },
            {
                'num': 4,
                'type': 1,
                'text': 'Метод двух включений.',
            },
            {
                'num': 5,
                'type': 1,
                'text': 'Основные законы алгебра множеств и их применение.',
            },
            {
                'num': 6,
                'type': 1,
                'text': 'Метод характеристических функций.',
            },
            {
                'num': 7,
                'type': 1,
                'text': 'Декартово произведение множеств.',
            },
            {
                'num': 8,
                'type': 1,
                'text': 'Бинарные отношения и их наглядное изображение.',
            },
            {
                'num': 9,
                'type': 1,
                'text': 'Основные свойства бинарных отношений.',
            },
            {
                'num': 10,
                'type': 1,
                'text': 'Отношения эквивалентности.',
            },
            {
                'num': 11,
                'type': 1,
                'text': 'Основные правила и формулы комбинаторики.',
            },
            {
                'num': 12,
                'type': 1,
                'text': 'Алгебра высказываний, логические операции над высказываниями.',
            },
            {
                'num': 13,
                'type': 1,
                'text': 'Булева алгебра, аксиомы булевой алгебры.',
            },
            {
                'num': 14,
                'type': 1,
                'text': 'Булевы функции. СДНФ и их минимизация.',
            },
            {
                'num': 15,
                'type': 1,
                'text': 'Рекуррентные соотношения и их основные виды.',
            },
            {
                'num': 16,
                'type': 1,
                'text': 'Решение однородных рекуррентных соотношений.',
            },
            {
                'num': 17,
                'type': 1,
                'text': 'Основные виды неоднородных рекуррентных соотношений.',
            },
            {
                'num': 18,
                'type': 1,
                'text': 'Основные понятия теории неориентированных графов.',
            },
            {
                'num': 19,
                'type': 1,
                'text': 'Последовательность рёбер длины N и степени матрицы смежности. Пути и циклы. ',
            },
            {
                'num': 20,
                'type': 1,
                'text': 'Эйлеровы графы.',
            },
            {
                'num': 21,
                'type': 1,
                'text': 'Гамильтоновы графы.',
            },
            {
                'num': 22,
                'type': 1,
                'text': 'Взвешенные графы. Дерево покрытия минимального веса. Прима-алгоритм. ',
            },
            {
                'num': 23,
                'type': 1,
                'text': 'Дерево покрытия минимального веса. «Жадный» алгоритм.',
            },
            {
                'num': 24,
                'type': 1,
                'text': 'Ориентированные графы.',
            },
            {
                'num': 25,
                'type': 1,
                'text': 'Самый короткий путь и алгоритм Дейкстры.',
            },
        ]
    },
    {
        'table_name': 'progers',
        'tasks': [
            {
                'num': 1,
                'type': 1,
                'text': 'Опишите архитектурные особенности процессоров x86.',
            },
            {
                'num': 2,
                'type': 1,
                'text': 'Раскройте особенности известных вам компиляторов языка ассемблера для процессоров x86.',
            },
            {
                'num': 3,
                'type': 1,
                'text': 'Приведите шаблон консольного приложения на языке ассемблера для процессоров x86.',
            },
            {
                'num': 4,
                'type': 1,
                'text': 'Приведите типы адресации в процессорах x86.',
            },
            {
                'num': 5,
                'type': 1,
                'text': 'Опишите назначение регистров в процессорах x86.',
            },
            {
                'num': 6,
                'type': 1,
                'text': 'Приведите директивы описания сегментов для известных вам компиляторов языка ассемблера. Раскройте назначение директивы .model.',
            },
            {
                'num': 7,
                'type': 1,
                'text': 'Приведите декларации и особенности использования простых типов данных языка ассемблерадляпроцессоров x86.',
            },
            {
                'num': 8,
                'type': 1,
                'text': 'Приведите декларации и особенности использования составных типовданных языка ассемблера для процессоров x86.',
            },
            {
                'num': 9,
                'type': 1,
                'text': 'Приведите синтаксис и особенности использования команд передачи данных в процессорах x86.',
            },
            {
                'num': 10,
                'type': 1,
                'text': 'Приведите синтаксис и особенности использования команд обработки цепочек в процессорах x86.',
            },
            {
                'num': 11,
                'type': 1,
                'text': 'Приведите синтаксис и особенности использования арифметических команд для беззнаковой арифметики в процессорах x86.',
            },
            {
                'num': 12,
                'type': 1,
                'text': 'Приведите синтаксис и особенности использования арифметических команд для знаковой арифметики в процессорах x86.',
            },
            {
                'num': 13,
                'type': 1,
                'text': 'Приведите синтаксис и особенности использования команд передачи управления.',
            },
            {
                'num': 14,
                'type': 1,
                'text': 'Опишите возможные организации циклов и ветвлений в процессорах x86. Раскройте назначение регистра признаков процессоров x86.',
            },
            {
                'num': 15,
                'type': 1,
                'text': 'Приведите синтаксис и особенности использования команд обработки битов в процессорах x86.',
            },
            {
                'num': 16,
                'type': 1,
                'text': 'Приведите синтаксис и особенности использования команд логических сдвигов в процессорах x86.',
            },
            {
                'num': 17,
                'type': 1,
                'text': 'Приведите синтаксис и особенности использования команд арифметических сдвигов в процессорах x86.',
            },
            {
                'num': 18,
                'type': 1,
                'text': 'Приведите расширения системы команд для современных процессоров x86.',
            },
            {
                'num': 19,
                'type': 1,
                'text': 'Опишите принципы работы со стеком. Приведите команды для работы со стеком в процессорах x86.',
            },
            {
                'num': 20,
                'type': 1,
                'text': 'Приведите декларациюпроцедуры на языке ассемблера и опишите способы её вызова.',
            },
            {
                'num': 21,
                'type': 1,
                'text': 'Приведите описание макроопределения на языке ассемблера и раскройте способы егоиспользования.',
            },
            {
                'num': 22,
                'type': 1,
                'text': 'Опишите назначение, типы данных и основные команды арифметического сопроцессора.',
            },
            {
                'num': 23,
                'type': 1,
                'text': 'Опишите особенности организации мультимедийных технологий в процессорах x86 и приведите их основные команды.',
            },
            {
                'num': 24,
                'type': 1,
                'text': 'Опишите особенности организации ООП на языке ассемблера процессоров x86.',
            },
            {
                'num': 25,
                'type': 1,
                'text': 'Раскройте основные принципы программирования в оконно-событийных операционных системах.',
            },
            {
                'num': 26,
                'type': 1,
                'text': 'Приведите шаблон оконного приложения и раскройте назначение его основных функций WinAPI.',
            },
            {
                'num': 27,
                'type': 1,
                'text': 'Опишите основные этапы создания и регистрации главного окна приложения.',
            },
            {
                'num': 28,
                'type': 1,
                'text': 'Раскройте назначение и опишите основные этапы работы цикла обработки сообщений.',
            },
            {
                'num': 29,
                'type': 1,
                'text': 'Опишите этапы создания ресурсов оконного приложения и раскройте особенности их использования.',
            },
            {
                'num': 30,
                'type': 1,
                'text': 'Опишите работус диалоговыми окнами и их дочерними элементами.',
            },
            {
                'num': 1,
                'type': 2,
                'text': 'Раскройте отличия индексной и базовой адресации операндов.',
            },
            {
                'num': 2,
                'type': 2,
                'text': 'Опишите отличия команд передачи управления по условию для знаковой и беззнаковой арифметики.',
            },
            {
                'num': 3,
                'type': 2,
                'text': 'Раскройте возможные способы проверки значения регистра процессора.',
            },
            {
                'num': 4,
                'type': 2,
                'text': 'Раскройте особенности использования цепочечных команд и команд организации циклов.',
            },
            {
                'num': 5,
                'type': 2,
                'text': 'Приведите возможные способы повышения быстродействия программ на языке ассемблера.',
            },
            {
                'num': 6,
                'type': 2,
                'text': 'Проанализируйте особенности использования процедур и макроопределений.',
            },
            {
                'num': 7,
                'type': 2,
                'text': 'Проанализируйте эффективность замены циклов цепочечными командами.',
            },
            {
                'num': 8,
                'type': 2,
                'text': 'Раскройте отличия реализации операций для знаковой и беззнаковой арифметики.',
            },
            {
                'num': 9,
                'type': 2,
                'text': 'Раскройте отличия одинарных и двойных сдвигов. Приведите команды реализации двойных сдвигов в процессорах x86.',
            },
            {
                'num': 10,
                'type': 2,
                'text': 'Раскройте отличия структур и объединений в языке ассемблера x86.',
            },
        ]
    },
    {
        'table_name': 'physics',
        'tasks': []
    }
]

